import {task_1} from './Task1/task1.mjs';
import {task_2} from "./Task2/task2.mjs";
import {task_3} from "./Task3/task3.mjs";

console.log("###############################################Task1###############################################");
task_1(
    "paawdawwWDSawdldaplwdaw",
    "Вот пример строки,в которой     используются знаки препинания." +
    "После знаков должны стоять пробелы , а перед знаками их быть не должно .   А еще!\"№%:?*()_+-=!@#$^&{}[]\\|/\'<>" +
    "Если . .. есть лишние подряд идущие пробелы, они должны быть устранены.",
    "Один два три четыре пять шесть семь восемь девять десять.",
    "Текст, в котором слово текст несколько раз встречается и слово тоже... А ?Да  !Нет ~ Вуп-Вуп  1+1&=2 {} \[\] / 1<>2@#$%^:;*()_| '"
);



console.log("###############################################Task2###############################################");
let a = 216465165446546543213215489465416549879846513249874643549876465146546;
let b = 987654135165465461321324654985465132132465465461321654654651651546486132454654;
console.log(a + " + " + b + " = " + task_2(a,b ,"+"));
console.log(a + " - " + b + " = " + task_2(a,b ,"-"));
console.log(a + " * " + b + " = " + task_2(a,b ,"*"));
console.log(a + " / " + b + " = " + task_2(a,b ,"/"));

console.log("###############################################Task3###############################################");
task_3()